FactoryGirl.define do
  factory :ntnu_organization, parent: :organization do
    code 'NTNU'
    name '國立臺灣師範大學'
    short_name '台師大'
    after(:create) do |ntnu|
      columns = [:organization_code, :code, :name, :short_name, :parent_code, :group]
      Department.import(columns,
        [

          ["NTNU", "E",    "教育學院", "教育學院", nil, 'C'],
          ["NTNU", "L",    "文學院", "文學院", nil, 'C'],
          ["NTNU", "S",    "理學院", "理學院", nil, 'C'],
          ["NTNU", "T",    "藝術學院", "藝術學院", nil, 'C'],
          ["NTNU", "H",    "科技學院", "科技學院", nil, 'C'],
          ["NTNU", "A",    "運休學院", "運休學院", nil, 'C'],
          ["NTNU", "I",    "國社學院", "國社學院", nil, 'C'],
          ["NTNU", "M",    "音樂學院", "音樂學院", nil, 'C'],
          ["NTNU", "O",    "管理學院", "管理學院", nil, 'C'],
          ["NTNU", "G",    "通識教育中心", "通識教育中心", nil, 'C'],

          ["NTNU", "E00",  "教育學研究所", "教育所", "E", 'D'],
          ["NTNU", "EU00", "教育學系", "教育系", "E", 'D'],
          ["NTNU", "EM00", "教育學研究所碩士班", "教育碩", "E00", 'MC'],
          ["NTNU", "ED00", "教育學研究所博士班", "教育博", "E00", 'DC'],
          ["NTNU", "SA00", "教育學輔系", "教育輔", "E", 'D'],

          ["NTNU", "E01",  "教育心理與輔導學研究所", "心輔所", "E", 'D'],
          ["NTNU", "EU01", "教育心理與輔導學系", "心輔系", "E", 'D'],
          ["NTNU", "EM01", "教育心理與輔導學研究所碩士班", "心輔碩", "E01", 'MC'],
          ["NTNU", "ED01", "教育心理與輔導學研究所博士班", "心輔博", "E01", 'DC'],
          ["NTNU", "SA01", "教育心理與輔導學輔系", "心輔輔", "E", 'D'],

          ["NTNU", "E02",  "社會教育學研究所", "社教所", "E", 'D'],
          ["NTNU", "EU02", "社會教育學系", "社教系", "E", 'D'],
          ["NTNU", "EM02", "社會教育學研究所碩士班", "社教碩", "E02", 'MC'],
          ["NTNU", "ED02", "社會教育學研究所博士班", "社教博", "E02", 'DC'],
          ["NTNU", "SA02", "社會教育學輔系", "社教輔", "E", 'D'],

          ["NTNU", "E03",  "課程與教學研究所", "課教所", "E", 'D'],
          ["NTNU", "EM03", "課程與教學研究所碩士班", "課教碩", "E03", 'MC'],
          ["NTNU", "ED03", "課程與教學研究所博士班", "課教博", "E03", 'DC'],

          ["NTNU", "E05",  "健康促進與衛生教育學研究所", "衛教所", "E", 'D'],
          ["NTNU", "EU05", "健康促進與衛生教育學系", "衛教系", "E", 'D'],
          ["NTNU", "EM05", "健康促進與衛生教育學研究所碩士班", "衛教碩", "E05", 'MC'],
          ["NTNU", "ED05", "健康促進與衛生教育學研究所博士班", "衛教博", "E05", 'DC'],
          ["NTNU", "SA05", "健康促進與衛生教育學輔系", "衛教輔", "E", 'D'],

          ["NTNU", "E06",  "人類發展與家庭學研究所", "人發所", "E", 'D'],
          ["NTNU", "EU06", "人類發展與家庭學系", "人發系", "E", 'D'],
          ["NTNU", "EM06", "人類發展與家庭學研究所碩士班", "人發碩", "E06", 'MC'],
          ["NTNU", "ED06", "人類發展與家庭學研究所博士班", "人發博", "E06", 'DC'],
          ["NTNU", "SA06", "人類發展與家庭學輔系", "人發輔", "E", 'D'],

          ["NTNU", "E07",  "公民教育與活動領導學研究所", "公領所", "E", 'D'],
          ["NTNU", "EU07", "公民教育與活動領導學系", "公領系", "E", 'D'],
          ["NTNU", "EM07", "公民教育與活動領導學研究所碩士班", "公領碩", "E07", 'MC'],
          ["NTNU", "ED07", "公民教育與活動領導學研究所博士班", "公領博", "E07", 'DC'],
          ["NTNU", "SA07", "公民教育與活動領導學輔系", "公領輔", "E", 'D'],

          ["NTNU", "E08",  "資訊教育研究所", "資訊所", "E", 'D'],
          ["NTNU", "EM08", "資訊教育研究所碩士班", "資訊碩", "E08", 'MC'],
          ["NTNU", "ED08", "資訊教育研究所博士班", "資訊博", "E08", 'DC'],
          ["NTNU", "SA08", "資訊教育研究所輔系", "資訊輔", "E", 'D'],

          ["NTNU", "E09",  "特殊教育研究所", "特教所", "E", 'D'],
          ["NTNU", "EU09", "特殊教育系", "特教系", "E", 'D'],
          ["NTNU", "EM09", "特殊教育研究所碩士班", "特教碩", "E09", 'MC'],
          ["NTNU", "ED09", "特殊教育研究所博士班", "特教博", "E09", 'DC'],
          ["NTNU", "SA09", "特殊教育系輔系", "特教輔", "E", 'D'],

          ["NTNU", "E15",  "圖書資訊學研究所", "圖資所", "E", 'D'],
          ["NTNU", "EM15", "圖書資訊學研究所碩士班", "圖資碩", "E15", 'MC'],
          ["NTNU", "ED15", "圖書資訊學研究所博士班", "圖資博", "E15", 'DC'],

          ["NTNU", "E16",  "教育政策與行政研究所", "教政所", "E", 'D'],
          ["NTNU", "EM16", "教育政策與行政研究所碩士班", "教政碩", "E16", 'MC'],

          ["NTNU", "E17",  "復健諮商研究所", "復諮所", "E", 'D'],
          ["NTNU", "EM17", "復健諮商研究所碩士班", "復諮碩", "E17", 'MC'],

          ["NTNU", "L20",  "國文學研究所", "國文所", "L", 'D'],
          ["NTNU", "LU20", "國文學系", "國文系", "L", 'D'],
          ["NTNU", "LM20", "國文學研究所碩士班", "國文碩", "L20", 'MC'],
          ["NTNU", "LD20", "國文學研究所博士班", "國文博", "L20", 'DC'],
          ["NTNU", "SA20", "國文學輔系", "國文輔", "L", 'D'],

          ["NTNU", "L21",  "英語學研究所", "英語所", "L", 'D'],
          ["NTNU", "LU21", "英語學系", "英語系", "L", 'D'],
          ["NTNU", "LM21", "英語學研究所碩士班", "英語碩", "L21", 'MC'],
          ["NTNU", "LD21", "英語學研究所博士班", "英語博", "L21", 'DC'],
          ["NTNU", "SA21", "英語學輔系", "英語輔", "L", 'D'],

          ["NTNU", "L22",  "歷史學研究所", "歷史所", "L", 'D'],
          ["NTNU", "LU22", "歷史學系", "歷史系", "L", 'D'],
          ["NTNU", "LM22", "歷史學研究所碩士班", "歷史碩", "L22", 'MC'],
          ["NTNU", "LD22", "歷史學研究所博士班", "歷史博", "L22", 'DC'],
          ["NTNU", "SA22", "歷史學輔系", "歷史輔", "L", 'D'],

          ["NTNU", "L23",  "地理學研究所", "地理所", "L", 'D'],
          ["NTNU", "LU23", "地理學系", "地理系", "L", 'D'],
          ["NTNU", "LM23", "地理學研究所碩士班", "地理碩", "L23", 'MC'],
          ["NTNU", "LD23", "地理學研究所博士班", "地理博", "L23", 'DC'],
          ["NTNU", "SA23", "地理學輔系", "地理輔", "L", 'D'],

          ["NTNU", "L25",  "翻譯研究所", "翻譯所", "L", 'D'],
          ["NTNU", "LM25", "翻譯研究所碩士班", "翻譯碩", "L25", 'MC'],
          ["NTNU", "LD25", "翻譯研究所博士班", "翻譯博", "L25", 'DC'],

          ["NTNU", "L26",  "臺灣語文學研究所", "臺文所", "L", 'D'],
          ["NTNU", "LU26", "臺灣語文學系", "臺文系", "L", 'D'],
          ["NTNU", "LM26", "臺灣語文學研究所碩士班", "臺文碩", "L26", 'MC'],
          ["NTNU", "LD26", "臺灣語文學研究所博士班", "臺文博", "L26", 'DC'],

          ["NTNU", "L27",  "臺灣史研究所", "臺史所", "L", 'D'],
          ["NTNU", "LM27", "臺灣史研究所碩士班", "臺史碩", "L27", 'MC'],

          ["NTNU", "S40",  "數學研究所", "數學所", "S", 'D'],
          ["NTNU", "SU40", "數學系", "數學系", "S", 'D'],
          ["NTNU", "SM40", "數學研究所碩士班", "數學碩", "S40", 'MC'],
          ["NTNU", "SD40", "數學研究所博士班", "數學博", "S40", 'DC'],
          ["NTNU", "SA40", "數學輔系", "數學輔", "S", 'D'],

          ["NTNU", "S41",  "物理學研究所", "物理所", "S", 'D'],
          ["NTNU", "SU41", "物理學系", "物理系", "S", 'D'],
          ["NTNU", "SM41", "物理學研究所碩士班", "物理碩", "S41", 'MC'],
          ["NTNU", "SD41", "物理學研究所博士班", "物理博", "S41", 'DC'],
          ["NTNU", "SA41", "物理學輔系", "物理輔", "S", 'D'],

          ["NTNU", "S42",  "化學研究所", "化學所", "S", 'D'],
          ["NTNU", "SU42", "化學系", "化學系", "S", 'D'],
          ["NTNU", "SM42", "化學研究所碩士班", "化學碩", "S42", 'MC'],
          ["NTNU", "SD42", "化學研究所博士班", "化學博", "S42", 'DC'],
          ["NTNU", "SA42", "化學輔系", "化學輔", "S", 'D'],

          ["NTNU", "S43",  "生命科學研究所", "生科所", "S", 'D'],
          ["NTNU", "SU43", "生命科學系", "生科系", "S", 'D'],
          ["NTNU", "SM43", "生命科學研究所碩士班", "生科碩", "S43", 'MC'],
          ["NTNU", "SD43", "生命科學研究所博士班", "生科博", "S43", 'DC'],
          ["NTNU", "SA43", "生命科學輔系", "生科輔", "S", 'D'],

          ["NTNU", "S44",  "地球科學研究所", "地科所", "S", 'D'],
          ["NTNU", "SU44", "地球科學系", "地科系", "S", 'D'],
          ["NTNU", "SM44", "地球科學研究所碩士班", "地科碩", "S44", 'MC'],
          ["NTNU", "SD44", "地球科學研究所博士班", "地科博", "S44", 'DC'],
          ["NTNU", "SA44", "地球科學輔系", "地科輔", "S", 'D'],

          ["NTNU", "S45",  "科學教育研究所", "科教所", "S", 'D'],
          ["NTNU", "SM45", "科學教育研究所碩士班", "科教碩", "S45", 'MC'],
          ["NTNU", "SD45", "科學教育研究所博士班", "科教博", "S45", 'DC'],

          ["NTNU", "S46",  "環境教育研究所", "環教所", "S", 'D'],
          ["NTNU", "SM46", "環境教育研究所碩士班", "環教碩", "S46", 'MC'],
          ["NTNU", "SD46", "環境教育研究所博士班", "環教博", "S46", 'DC'],

          ["NTNU", "S47",  "資訊工程研究所", "資工所", "S", 'D'],
          ["NTNU", "SU47", "資訊工程學系", "資工系", "S", 'D'],
          ["NTNU", "SM47", "資訊工程研究所碩士班", "資工碩", "S47", 'MC'],
          ["NTNU", "SD47", "資訊工程研究所博士班", "資工博", "S47", 'DC'],

          ["NTNU", "S48",  "光電科技研究所", "光電所", "S", 'D'],
          ["NTNU", "SM48", "光電科技研究所碩士班", "光電碩", "S48", 'MC'],
          ["NTNU", "SD48", "光電科技研究所博士班", "光電博", "S48", 'DC'],

          ["NTNU", "S49",  "海洋環境科技研究所", "海環所", "S", 'D'],
          ["NTNU", "SM49", "海洋環境科技研究所碩士班", "海環碩", "S49", 'MC'],

          ["NTNU", "SD50", "生物多樣性學位學程", "生物多樣學位學程", "S", 'D'],

          ["NTNU", "T60",  "美術研究所", "美術所", "T", 'D'],
          ["NTNU", "TU60", "美術學系", "美術系", "T", 'D'],
          ["NTNU", "TM60", "美術研究所碩士班", "美術碩", "T60", 'MC'],
          ["NTNU", "TD60", "美術研究所博士班", "美術博", "T60", 'DC'],

          ["NTNU", "T67",  "藝術史研究所", "藝史所", "T", 'D'],
          ["NTNU", "TM67", "藝術史研究所碩士班", "藝史碩", "T67", 'MC'],

          ["NTNU", "T68",  "設計研究所", "設計所", "T", 'D'],
          ["NTNU", "TU68", "設計學系", "設計系", "T", 'D'],
          ["NTNU", "TM68", "設計研究所碩士班", "設計碩", "T68", 'MC'],
          ["NTNU", "TD68", "設計研究所博士班", "設計博", "T68", 'DC'],

          ["NTNU", "H70",  "工業教育研究所", "工教所", "H", 'D'],
          ["NTNU", "HU70", "工業教育學系", "工教系", "H", 'D'],
          ["NTNU", "HM70", "工業教育研究所碩士班", "工教碩", "H70", 'MC'],
          ["NTNU", "HD70", "工業教育研究所博士班", "工教博", "H70", 'DC'],

          ["NTNU", "H71",  "科技應用與人力資源發展研究所", "科技所", "H", 'D'],
          ["NTNU", "HU71", "科技應用與人力資源發展學系", "科技系", "H", 'D'],
          ["NTNU", "HM71", "科技應用與人力資源發展研究所碩士班", "科技碩", "H71", 'MC'],
          ["NTNU", "HD71", "科技應用與人力資源發展研究所博士班", "科技博", "H71", 'DC'],
          ["NTNU", "SA71", "科技應用與人力資源發展輔系", "科技輔", "H", 'D'],

          ["NTNU", "H72",  "圖文傳播研究所", "圖傳所", "H", 'D'],
          ["NTNU", "HU72", "圖文傳播學系", "圖傳系", "H", 'D'],
          ["NTNU", "HM72", "圖文傳播研究所碩士班", "圖傳碩", "H72", 'MC'],

          ["NTNU", "H73",  "機電工程研究所", "機電所", "H", 'D'],
          ["NTNU", "HU73", "機電工程學系", "機電系", "H", 'D'],
          ["NTNU", "HM73", "機電工程研究所碩士班", "機電碩", "H73", 'MC'],
          ["NTNU", "HD73", "機電工程研究所博士班", "機電博", "H73", 'DC'],

          ["NTNU", "H75",  "電機工程研究所", "電機所", "H", 'D'],
          ["NTNU", "HU75", "電機工程學系", "電機系", "H", 'D'],
          ["NTNU", "HM75", "電機工程研究所碩士班", "電機碩", "H75", 'MC'],

          ["NTNU", "A30",  "體育研究所", "體育所", "A", 'D'],
          ["NTNU", "AU30", "體育學系", "體育系", "A", 'D'],
          ["NTNU", "AM30", "體育研究所碩士班", "體育碩", "A30", 'MC'],
          ["NTNU", "AD30", "體育研究所博士班", "體育博", "A30", 'DC'],

          ["NTNU", "A31",  "運動休閒與餐旅管理研究所", "休旅所", "A", 'D'],
          ["NTNU", "AM31", "運動休閒與餐旅管理研究所碩士班", "休旅碩", "A31", 'MC'],
          ["NTNU", "AD31", "運動休閒與餐旅管理研究所博士班", "休旅博", "A31", 'DC'],

          ["NTNU", "A32",  "運動競技研究所", "競技所", "A", 'D'],
          ["NTNU", "AU32", "運動競技學系", "競技系", "A", 'D'],
          ["NTNU", "AM32", "運動競技研究所碩士班", "競技碩", "A32", 'MC'],

          ["NTNU", "I82",  "歐洲文化與觀光研究所", "歐文所", "I", 'D'],
          ["NTNU", "IM82", "歐洲文化與觀光研究所碩士班", "歐文碩", "I82", 'MC'],

          ["NTNU", "I83",  "東亞研究所", "東亞所", "I", 'D'],
          ["NTNU", "IU83", "東亞學系", "東亞系", "I", 'D'],
          ["NTNU", "IM83", "東亞研究所碩士班", "東亞碩", "I83", 'MC'],

          ["NTNU", "I84",  "華語文教學研究所", "華語所", "I", 'D'],
          ["NTNU", "IU84", "華語文教學系", "華語系", "I", 'D'],
          ["NTNU", "IM84", "華語文教學研究所碩士班", "華語碩", "I84", 'MC'],
          ["NTNU", "ID84", "華語文教學研究所博士班", "華語博", "I84", 'DC'],

          ["NTNU", "I85",  "應用華語文學系研究所", "應華所", "I", 'D'],
          ["NTNU", "IU85", "應用華語文學系", "應華系", "I", 'D'],
          ["NTNU", "IM85", "應用華語文學系研究所碩士班", "應華碩", "I85", 'MC'],

          ["NTNU", "I86",  "國際人力資源發展研究所", "人資所", "I", 'D'],
          ["NTNU", "IM86", "國際人力資源發展研究所碩士班", "人資碩", "I86", 'MC'],

          ["NTNU", "IM7",  "政治學研究所", "政治所", "I", 'D'],
          ["NTNU", "IM87", "政治學研究所碩士班", "政治碩", "I87", 'MC'],
          ["NTNU", "ID87", "政治學研究所博士班", "政治博", "I87", 'DC'],

          ["NTNU", "I88",  "大眾傳播研究所", "大傳所", "I", 'D'],
          ["NTNU", "IM88", "大眾傳播研究所碩士班", "大傳碩", "I88", 'MC'],

          ["NTNU", "I89",  "社會工作學研究所", "社工所", "I", 'D'],
          ["NTNU", "IM89", "社會工作學研究所碩士班", "社工碩", "I89", 'MC'],

          ["NTNU", "M90",  "音樂學研究所", "音樂所", "M", 'D'],
          ["NTNU", "MU90", "音樂學系", "音樂系", "M", 'D'],
          ["NTNU", "MM90", "音樂學研究所碩士班", "音樂碩", "M90", 'MC'],
          ["NTNU", "MD90", "音樂學研究所博士班", "音樂博", "M90", 'DC'],

          ["NTNU", "M91",  "民族音樂研究所", "民音所", "M", 'D'],
          ["NTNU", "MM91", "民族音樂研究所博士班", "民音碩", "M91", 'DC'],

          ["NTNU", "M92",  "表演藝術研究所", "表演所", "M", 'D'],
          ["NTNU", "MU92", "表演藝術學士學位學程", "表演學位學程", "M", 'D'],
          ["NTNU", "MM92", "表演藝術研究所碩士班", "表演碩", "M92", 'MC'],

          ["NTNU", "MM93", "流行音樂產業碩士專班", "流行碩", "M", 'D'],

          ["NTNU", "O55",  "管理研究所", "管理所", "O", 'D'],
          ["NTNU", "OM55", "管理研究所碩士班", "管理碩", "O55", 'MC'],

          ["NTNU", "O56",  "全球經營與策略研究所", "全營所", "O", 'D'],
          ["NTNU", "OM56", "全球經營與策略研究所碩士班", "全營碩", "O56", 'MC'],

          ["NTNU", "OU57", "企業管理學士學位學程", "企管學位學程", "O", 'P'],
          ["NTNU", "OU58", "高階經理人企業管理碩士在職專班", "高階經理人企業管理碩士在職專班", "O", 'P'],
          ["NTNU", "ZU80", "創新管理學程", "創新管理學程", "O", 'P'],
          ["NTNU", "ZU81", "生資技術學程", "生資技術學程", "SU43", 'P'],
          ["NTNU", "ZU82", "光電學程", "光電學程", "SU41", 'P'],
          ["NTNU", "ZU83", "基礎管理學程", "基礎管理學程", "O", 'P'],
          ["NTNU", "ZU84", "財金學程", "財金學程", "EU07", 'P'],
          ["NTNU", "ZU85", "數位內容與創新應用學分學程", "數位內容學程", "E15", 'P'],
          ["NTNU", "ZU86", "華語文教學學程", "華語教學學程", "I84", 'P'],
          ["NTNU", "ZU87", "文化創意產業學分學程", "文化創意學程", "M92", 'P'],
          ["NTNU", "ZU88", "數位影音藝術學分學程", "影音藝術學程", "M90", 'P'],
          ["NTNU", "ZU89", "環境監測與防災學程", "環境監測學程", "LU23", 'P'],
          ["NTNU", "ZU90", "生態藝術與科普傳播學分學程", "生態藝術學程", "TU68", 'P'],
          ["NTNU", "ZU91", "音樂數位典藏與創作學分學程", "音樂典藏學程", "M91", 'P'],
          ["NTNU", "ZU92", "榮譽英語學分學程", "榮譽英語學程", "LU21", 'P'],
          ["NTNU", "ZU93", "法語學程", "法語學程", "L", 'P'],
          ["NTNU", "ZU94", "文學創作學分學程", "文學創作學程", "LU20", 'P'],
          ["NTNU", "ZU95", "亞太研究學程", "亞太研究學程", "IU83", 'P'],
          ["NTNU", "ZU96", "德語學程", "德語學程", "L", 'P'],
          ["NTNU", "ZU97", "日語學程", "日語學程", "L", 'P'],
          ["NTNU", "ZU98", "高齡健康促進學程", "高齡健康促進學程", "G", 'P'],
          ["NTNU", "ZU99", "光電藝術學分學程", "光電藝術學程", "S48", 'P'],
          ["NTNU", "ZU9A", "區域與觀光規劃學程", "區域學程", "LU23", 'P'],
          ["NTNU", "ZU9B", "空間資訊學程", "空間學程", "LU23", 'P'],
          ["NTNU", "ZU9C", "學校心理學學分學程", "學校心理學學程", "EU01", 'P'],
          ["NTNU", "ZU9D", "應用史學學分學程", "應史學程", "LU22", 'P'],
          ["NTNU", "ZU9E", "社會、政治與大眾傳播學分學程", "社會政治大傳學程", "I88", 'P'],
          ["NTNU", "ZU9F", "技術及職業教育學分學程", "技職教育學程", "HU70", 'P'],
          ["NTNU", "ZU9G", "復健諮商學分學程", "復諮學程", "E17", 'P'],
          ["NTNU", "ZU9H", "高科技產業國際金融管理學程", "高科技金融學程", "O", 'P'],
          ["NTNU", "ZU9I", "文化創意與科技藝術學分學程", "文創藝術學程", "M92", 'P'],
          ["NTNU", "ZU9J", "創意設計實務學分學程", "設計實務學程", "TU68", 'P'],
          ["NTNU", "ZU9K", "數位評量調查學程", "數位評量調查學程", "EU01", 'P'],
          ["NTNU", "ZU9L", "生態藝術與科普傳播學分學程", "生態藝術科普學程", "TU68", 'P'],
          ["NTNU", "ZU9M", "服務管理實務學分學程", "服務管理學程", "O", 'P']

        ], :validate => false
      )

      if ntnu.email_patterns.count < 1
        create(:ntnu_student_email_pattern)
        create(:ntnu_staff_email_pattern)
      end
    end
  end

  factory :ntnu_student_email_pattern, parent: :email_pattern do
    priority 18
    organization { Organization.find_by(code: 'NTNU') || create(:ntnu_organization) }
    corresponded_identity UserIdentity::IDENTITIES[:student]
    email_regexp '^(?<uid>\\d(?<started_at>\\d{3})[0-9a-zA-Z]{2,12})@ntnu\\.edu\\.tw$'
    uid_postparser "n.toLowerCase()"
    started_at_postparser "new Date((parseInt(n)+1911) + '-9')"
    permit_changing_department_in_organization true
  end

  factory :ntnu_staff_email_pattern, parent: :email_pattern do
    priority 100
    organization { Organization.find_by(code: 'NTNU') || create(:ntnu_organization) }
    corresponded_identity UserIdentity::IDENTITIES[:staff]
    email_regexp '^(?<uid>.+)@ntnu\\.edu\\.tw$'
    uid_postparser "n.toLowerCase()"
    permit_changing_department_in_organization true
  end
end
