FactoryGirl.define do
  factory :ttu_organization, parent: :organization do
    code 'TTU'
    name '大同大學'
    short_name '大同'
    after(:create) do |ttu|
      columns = [:organization_code, :code, :name, :short_name, :parent_code, :group]
      Department.import(columns,
        [
          ["TTU", "00", "工程學院", "工程學院", nil, 'C'],
          ["TTU", "01", "電機資訊學院", "電機資訊學院", nil, 'C'],
          ["TTU", "02", "經營學院", "經營學院", nil, 'C'],
          ["TTU", "03", "設計學院", "設計學院", nil, 'C'],

          ["TTU", "000", "機械工程系", "機械工程系", "00", 'D'],
          ["TTU", "001", "機械工程所", "機械工程所", "00", 'D'],
          ["TTU", "002", "生物工程系", "生物工程系", "00", 'D'],
          ["TTU", "003", "生物工程所", "生物工程所", "00", 'D'],
          ["TTU", "004", "材料工程系", "材料工程系", "00", 'D'],
          ["TTU", "005", "材料工程所", "材料工程所", "00", 'D'],
          ["TTU", "006", "工程管理學位學程碩士在職專班", "工程管理學位學程碩士在職專班", "00", 'D'],
          ["TTU", "007", "化學工程系", "化學工程系", "00", 'D'],
          ["TTU", "008", "化學工程所", "化學工程所", "00", 'D'],
          ["TTU", "009", "能源科技碩士學位學程班", "能源科技碩士學位學程班", "00", 'D'],

          ["TTU", "010", "電機工程系", "電機工程系", "01", 'D'],
          ["TTU", "011", "電機工程所", "電機工程所", "01", 'D'],
          ["TTU", "012", "光電工程研究所", "光電工程研究所", "01", 'D'],
          ["TTU", "013", "資訊工程系", "資訊工程系", "01", 'D'],
          ["TTU", "014", "資訊工程所", "資訊工程所", "01", 'D'],
          ["TTU", "015", "通訊工程研究所", "通訊工程研究所", "01", 'D'],
          ["TTU", "016", "應用數學系", "應用數學系", "01", 'D'],
          ["TTU", "017", "應用數學所", "應用數學所", "01", 'D'],
          ["TTU", "018", "物理教學組", "物理教學組", "01", 'D'],

          ["TTU", "020", "事業經營系", "事業經營學系", "02",'D'],
          ["TTU", "021", "事業經營所", "事業經營學所", "02",'D'],
          ["TTU", "022", "資訊經營系", "資訊經營學系", "02",'D'],
          ["TTU", "023", "資訊經營所", "資訊經營學所", "02",'D'],
          ["TTU", "024", "應用外語系", "應用外語學系", "02",'D'],

          ["TTU", "030", "工業設計系", "工業設計系", "03",'D'],
          ["TTU", "031", "工業設計所", "工業設計所", "03",'D'],
          ["TTU", "032", "媒體設計系", "媒體設計系", "03",'D'],
          ["TTU", "033", "設計科學研究所", "設計科學研究所", "03",'D']
        ], :validate => false
      )

    end
  end
end